/*-----------------------------------------------------------------------------------------------------
【平    台】keil
【适 用 单 片 机】msp432P401R
【底 层 库】TIVA WARE /msp432p4xx
【开 发】e芯工作室
/*@@ 库仅供参考 后果自负
 *
 * 版本 v1.0
 * 时间 2020年10月23日22:29:47
-------------------------------------------------------------------------------------------------------*/
#include "headfile.h"

uint8 IIC_test_num[8]={0x01,0x31,0x00,0xff,0x5a,0xa5,0x88,0xfd};


int main()
{
    system_init(1);//初始化滴答计时器
    set_DCO_48MH();//注意这边的函数与其他例程不同，其他例程SMCLK为3MHZ，为了得到更高占空比可调范围，以及更高的电机基频率，本例程分频SMCLK为24MHZ
    IIC_init();
    while(1)
    {
        uint8 i;
        for(i=0;i<8;i++)
        {
            IIC_start();
            IIC_Send_Byte(IIC_test_num[i]);
            IIC_ACK();
            IIC_stop();
        }
    }
		return 0 ;
}
